### Importação da biblioteca Pandas

In [1]:
import pandas as pd
import numpy as np

### Lê o arquivo 'credito.csv' e joga para o dataframe

In [2]:
dataframe = pd.read_csv('credito.csv', index_col='client_id')

In [3]:
dataframe.head()

                  renda  idade   empréstimo
client_id
1          66155.925095     59  8106.532131
2          34415.153966     48  6564.745018
3          57317.170063     63  8020.953296
4          42709.534201     46  6103.642260
5          66952.688845     19  8770.099235

### Salva o dataframe em um novo arquivo chamado 'creditoe2.csv'

In [4]:
dataframe.to_csv('credito2.csv')

### Lê o arquivo 'credito2.csv' e joga para o dataframe2

In [5]:
dataframe2 = pd.read_csv('credito2.csv', index_col='client_id')

### Describe shows a quick statistic summary of your data

In [6]:
dataframe2.describe()

              renda        idade    empréstimo
count   2000.000000  2000.000000   2000.000000
mean   45331.600018    40.807500   4444.369695
std    14326.327119    13.621425   3045.410024
min    20014.489470   -52.000000      1.377630
25%    32796.459717    29.000000   1939.708847
50%    45789.117313    41.000000   3974.719419
75%    57791.281668    53.000000   6432.410625
max    69995.685578    64.000000  13766.051239

### Mostra a média das colunas

In [7]:
dataframe2.mean()

renda         45331.600018
idade            40.807500
empréstimo     4444.369695
dtype: float64

###  Mostra as linhas que possuem Idade menor que 0

In [8]:
dataframe2[dataframe2['idade'] < 0]

                  renda  idade   empréstimo
client_id
16         50501.726689    -28  3977.287432
22         32197.620701    -52  4244.057136
27         63287.038908    -36  9595.286289

### Seleciona todas as colunas que possuem 'idade' negativa e transforma no valor absoluto

In [9]:
dataframe2[dataframe2['idade'] < 0] = abs(dataframe2['idade'])

In [10]:
dataframe2.describe()

              renda        idade    empréstimo
count   2000.000000  2000.000000   2000.000000
mean   45258.648825    40.943500   4435.515379
std    14424.199920    13.269678   3047.984109
min       28.000000    18.000000      1.377630
25%    32751.700392    29.000000   1932.453823
50%    45776.207139    41.000000   3964.990626
75%    57771.032285    53.000000   6428.192991
max    69995.685578    64.000000  13766.051239

### Cria uma nova coluna, se a renda for maior que o empréstimo, define com 1, se for menor, define como 0

In [23]:
dataframe2['renda/emp'] = np.where(dataframe2['renda']>dataframe2['empréstimo'],1, 0)

In [25]:
dataframe2[dataframe2['renda/emp'] == 0]

           renda  idade  empréstimo  renda/emp
client_id
16          28.0     52        36.0          0
22          28.0     52        36.0          0
27          28.0     52        36.0          0

In [26]:
dataframe2[dataframe2['renda/emp'] == 1]

                  renda  idade   empréstimo  renda/emp
client_id
1          66155.925095     59  8106.532131          1
2          34415.153966     48  6564.745018          1
3          57317.170063     63  8020.953296          1
4          42709.534201     46  6103.642260          1
5          66952.688845     19  8770.099235          1
...                 ...    ...          ...        ...
1996       59221.044874     49  1926.729397          1
1997       69516.127573     23  3503.176156          1
1998       44311.449262     28  5522.786693          1
1999       43756.056605     64  1622.722598          1
2000       69436.579552     56  7378.833599          1

[1997 rows x 4 columns]

### Subsescreve o arquivo 'credito2.csv'

In [18]:
dataframe2.to_csv('credito2.csv')